"InvoiceMaster Pro" = "InvoiceMaster Pro";
"Dashboard" = "Dashboard";
"Clients" = "Clients";
"Items" = "Items";
"Estimates" = "Estimates";
"Invoices" = "Invoices";
"Templates" = "Templates";
"Upload Logo" = "Upload Logo";
"Remove Logo" = "Remove Logo";
"Preview" = "Preview";
"Save" = "Save";
"Settings" = "Settings";
"New Client" = "New Client";
"New Item" = "New Item";
"New" = "New";
"Number" = "Number";
"Issue Date" = "Issue Date";
"Currency" = "Currency";
"Notes" = "Notes";
"Export PDF" = "Export PDF";
"Sign In" = "Sign In";
"Register" = "Register";
"Please restart the app to apply language." = "Please restart the app to apply language.";
"Quit Now" = "Quit Now";
"Later" = "Later";
"General" = "General";
"Documents" = "Documents";
"Sign Out" = "Sign Out";
"Welcome to InvoiceMaster Pro" = "Welcome to InvoiceMaster Pro";
"Search" = "Search";
"Status" = "Status";
"All" = "All";
"Draft" = "Draft";
"Sent" = "Sent";
"Paid" = "Paid";
"Language" = "Language";
"App Language" = "App Language";
"Backup" = "Backup";
"Export Backup" = "Export Backup";
"Import Backup" = "Import Backup";
"Delete" = "Delete";
"Appearance" = "Appearance";
"Theme" = "Theme";
"System" = "System";
"Light" = "Light";
"Dark" = "Dark";
"Currency" = "Currency";
"OpenExchangeRates API Key" = "OpenExchangeRates API Key";
"Type to search across clients, invoices, estimates and items." = "Type to search across clients, invoices, estimates and items.";
"Close" = "Close";
"Delete this client?" = "Delete this client?";
"This will also remove its association from documents." = "This will also remove its association from documents.";
"Delete this item?" = "Delete this item?";
"This will not delete line items already using it." = "This will not delete line items already using it.";
"Cancel" = "Cancel";
"Invoice" = "Invoice";
"Estimate" = "Estimate";
"Description" = "Description";
"Qty" = "Qty";
"Tax %" = "Tax %";
"Line Items" = "Line Items";
"Add" = "Add";
"Blank Line" = "Blank Line";
"Subtotal" = "Subtotal";
"Tax" = "Tax";
"Total" = "Total";
"Name" = "Name";
"Email" = "Email";
"Phone" = "Phone";
"Address" = "Address";
"City" = "City";
"Country" = "Country";
"Tax ID" = "Tax ID";
"Notes" = "Notes";
"New Item" = "New Item";
"Unit" = "Unit";
"Unit Price" = "Unit Price";
"Tax Rate %" = "Tax Rate %";
"Bill From" = "Bill From";
"Bill To" = "Bill To";
"Revenue" = "Revenue";
"Unpaid" = "Unpaid";
"Overdue" = "Overdue";
"Cash Flow" = "Cash Flow";
"Top Products" = "Top Products";
"List" = "List";
"Board" = "Board";
"Calendar" = "Calendar";
"Duplicate" = "Duplicate";
"Please fix the following issues:" = "Please fix the following issues:";
"Number is required" = "Number is required";
"Currency is required" = "Currency is required";
"Description is required" = "Description is required";
"Select" = "Select";
"Selected" = "Selected";
"Set Status" = "Set Status";
"Delete Selected" = "Delete Selected";
"Are you sure you want to delete the selected documents?" = "Are you sure you want to delete the selected documents?";
"Reports" = "Reports";
"Revenue by Month" = "Revenue by Month";
"Unpaid Summary" = "Unpaid Summary";
"From" = "From";
"To" = "To";
"Currency Filter" = "Currency Filter";
"All Currencies" = "All Currencies";
"Export CSV" = "Export CSV";
"Top Clients" = "Top Clients";
"Unknown Client" = "Unknown Client";
"Unknown Item" = "Unknown Item";
"Notifications" = "Notifications";
"Enable Notifications" = "Enable Notifications";
"Days before due" = "Days before due";
"Send Test Notification" = "Send Test Notification";
"Invoice Due Soon" = "Invoice Due Soon";
"Invoice %@ is due on %@." = "Invoice %@ is due on %@.";
"Test Notification" = "Test Notification";
"This is a test notification from InvoiceMaster Pro." = "This is a test notification from InvoiceMaster Pro.";
"Preferences" = "Preferences";
"Language Change" = "Language Change";
"The application needs to restart for the language change to take effect." = "The application needs to restart for the language change to take effect.";
"Restart Now" = "Restart Now";
"Later" = "Later";

/* BTP Construction Specific Translations */

/* Construction Types */
"construction.new" = "New Construction";
"construction.renovation" = "Renovation";
"construction.extension" = "Extension";
"construction.amenagement" = "Development";
"construction.maintenance" = "Maintenance";
"construction.repair" = "Repair";

/* Work Zones */
"zone.interior" = "Interior";
"zone.exterior" = "Exterior";
"zone.both" = "Int. & Ext.";
"zone.infrastructure" = "Infrastructure";
"zone.roof" = "Roof";
"zone.facade" = "Facade";

/* Corps d'état - Construction Trades */
"corps.gros_oeuvre" = "Structural Work";
"corps.terrassement" = "Earthwork";
"corps.fondations" = "Foundations";
"corps.maconnerie" = "Masonry";
"corps.beton_arme" = "Reinforced Concrete";
"corps.charpente" = "Framework";
"corps.couverture" = "Roofing";
"corps.etancheite" = "Waterproofing";
"corps.isolation" = "Insulation";
"corps.cloisons" = "Partitions";
"corps.platerie" = "Plasterwork";
"corps.menuiserie_ext" = "External Joinery";
"corps.menuiserie_int" = "Internal Joinery";
"corps.fermetures" = "Closures";
"corps.verrerie" = "Glazing";
"corps.plomberie" = "Plumbing";
"corps.electricite" = "Electrical";
"corps.chauffage" = "Heating";
"corps.climatisation" = "Air Conditioning";
"corps.ventilation" = "Ventilation";
"corps.ascenseurs" = "Elevators";
"corps.carrelage" = "Tiling";
"corps.sols" = "Soft Flooring";
"corps.peinture" = "Painting";
"corps.papier_peint" = "Wallpaper";
"corps.faience" = "Wall Tiles";
"corps.facade" = "Facade";
"corps.bardage" = "Cladding";
"corps.vrd" = "Roads & Utilities";
"corps.espaces_verts" = "Landscaping";
"corps.clotures" = "Fencing";
"corps.cuisines" = "Kitchens";
"corps.salles_bains" = "Bathrooms";
"corps.domotique" = "Home Automation";
"corps.securite" = "Security";
"corps.nettoyage" = "Cleaning";

/* Units */
"unit.m2" = "m²";
"unit.cm2" = "cm²";
"unit.hectare" = "ha";
"unit.m3" = "m³";
"unit.litre" = "L";
"unit.dm3" = "dm³";
"unit.m" = "m";
"unit.cm" = "cm";
"unit.mm" = "mm";
"unit.km" = "km";
"unit.ml" = "ml";
"unit.kg" = "kg";
"unit.tonne" = "T";
"unit.gramme" = "g";
"unit.unite" = "u";
"unit.piece" = "pce";
"unit.lot" = "lot";
"unit.ensemble" = "set";
"unit.forfait" = "package";
"unit.global" = "global";
"unit.heure" = "h";
"unit.jour" = "d";
"unit.semaine" = "wk";
"unit.mois" = "mo";
"unit.point" = "pt";
"unit.ouvrant" = "opening";
"unit.poste" = "item";
"unit.circuit" = "circuit";
"unit.paire" = "pair";

/* Document Types */
"document.invoice" = "Invoice";
"document.quote" = "Quote";
"document.project" = "Project";
"document.work_order" = "Work Order";

/* Status */
"status.draft" = "Draft";
"status.sent" = "Sent";
"status.accepted" = "Accepted";
"status.rejected" = "Rejected";
"status.in_progress" = "In Progress";
"status.completed" = "Completed";
"status.paid" = "Paid";
"status.overdue" = "Overdue";
"status.cancelled" = "Cancelled";

/* Legal Terms */
"legal.vat_number" = "VAT Number";
"legal.company_registration" = "Company Registration";
"legal.insurance_number" = "Insurance Number";
"legal.payment_terms" = "Payment Terms";
"legal.warranty" = "Warranty";
"legal.liability" = "Liability";
"legal.payment_due" = "Payment Due";
"legal.late_payment_interest" = "Late Payment Interest";

/* Project Information */
"project.name" = "Project Name";
"project.address" = "Site Address";
"project.start_date" = "Start Date";
"project.end_date" = "End Date";
"project.phase" = "Phase";
"project.coordinator" = "Coordinator";
"project.permit_number" = "Permit Number";

/* Financial */
"financial.subtotal" = "Subtotal";
"financial.vat" = "VAT";
"financial.total" = "Total";
"financial.discount" = "Discount";
"financial.advance" = "Advance";
"financial.retention" = "Retention";
"financial.margin" = "Margin";
"financial.cost_price" = "Cost Price";
"financial.selling_price" = "Selling Price";

/* Certifications */
"certification.rge" = "RGE";
"certification.qualibat" = "Qualibat";
"certification.qualit_enr" = "Qualit'EnR";
"certification.pro_ite" = "Pro-ITE";
"certification.eco_artisan" = "Eco-Artisan";
"certification.certibat" = "Certibat";
"certification.cekal" = "Cekal";
"certification.cerga" = "CERGA";
"certification.wtcb" = "WTCB";
"certification.belgium_green_building" = "Belgium Green Building Council";
"certification.atg" = "ATG";
"certification.ce_marking" = "CE Marking";
"certification.iso_9001" = "ISO 9001";
"certification.iso_14001" = "ISO 14001";
"certification.ohsas_18001" = "OHSAS 18001";

/* Client Types */
"client.individual" = "Individual";
"client.company" = "Company";

/* Export */
"export.documents" = "Documents";
"export.clients" = "Clients";
"export.items" = "Items";
"export.accounting" = "Accounting Entries";
"export.error.invalid_date_range" = "Invalid date range";
"export.error.currency_required" = "Currency required";


